%--------------------------------------------------------------------------

% SEIR模型 初始化
%
% 1、S 类：易感者 (Susceptible)，指未得病者，但缺乏免疫能力，与感染者接触后容易受到感染；
% 
% 2、E 类：暴露者 (Exposed)，指接触过感染者，但暂无能力传染给其他人的人，对潜伏期长的传染病适用；
% 
% 3、I 类：感病者 (Infectious)，指染上传染病的人，可以传播给 S 类成员，将其变为 E 类或 I 类成员；
% 
% 4、R 类：康复者 (Recovered)，指被隔离或因病愈而具有免疫力的人。如免疫期有限，R 类成员可以重新变为 S 类。

%--------------------------------------------------------------------------

clear;clc;

%--------------------------------------------------------------------------

% 参数设置

%--------------------------------------------------------------------------

N = 10000;

E = 0;

I = 1;

S = N - I;

R = 0;

% r：感染患者（I）每天接触的易感者数目，本例为20
r = 20;

% β：传染系数；由疾病本身的传播能力，人群的防控能力决定，本例设置为0.03
B = 0.03;

% γ：恢复系数；一般为病程的倒数。本例治疗期平均为11d，故本例为1/11
a = 1/11;

% α：潜伏者的发病概率；一般为潜伏期的倒数。潜伏期平均为5d，故本例为0.2
y = 0.2;

% t1:将潜伏期和发病到确诊的时间合并为潜伏期时间滞后，将t1设置为7d
timeE = 7  ;
%
timeC = 14 ;

T = 1:150;



for i = 1:length(T)-1

        S(i+1) = S(i) - r*B*S(i)*I(i)/N(1);

        E(i+1) = E(i) + r*B*S(i)*I(i)/N(1)-a*E(i);

        I(i+1) = I(i) + a*E(i) - y*I(i);

        R(i+1) = R(i) + y*I(i);

end

plot(T,S,T,E,T,I,T,R);

grid on;%添加网格线

xlabel('天');ylabel('人数')

legend('易感者','潜伏者','传染者','康复者')
